GitConverter/src/InformationRegisters/НастройкиЗаявок/НастройкиЗаявок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиЗаявок</name>
  <comment>Регистр для хранения настроек системы заявок</comment>
  <informationRegisterPeriodicity>Nonperiodical</informationRegisterPeriodicity>
  <dimensions>
    <name>НастройкаПараметр</name>
    <comment>Параметр настройки (тип настройки)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <resources>
    <name>ЗначениеСтрока</name>
    <comment>Строковое значение настройки</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗначениеБулево</name>
    <comment>Булево значение настройки</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗначениеСписок</name>
    <comment>Список пользователей или других значений в формате XML</comment>
    <type>
      <types>String</types>
    </type>
  </resources>
</mdclass:InformationRegister>

GitConverter/src/Enums/СтатусыЗаявок/СтатусыЗаявок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗаявок</name>
  <comment>Перечисление статусов заявок</comment>
  <enumValues>
    <name>Открыта</name>
    <comment>Заявка подана и ожидает рассмотрения</comment>
  </enumValues>
  <enumValues>
    <name>Одобрена</name>
    <comment>Заявка одобрена администратором</comment>
  </enumValues>
  <enumValues>
    <name>Отказано</name>
    <comment>В заявке отказано администратором</comment>
  </enumValues>
</mdclass:Enum>

GitConverter/src/Documents/Заявка/Заявка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Заявка</name>
  <comment>Документ для регистрации заявок на отгул, отпуск, больничный, жалоб и пожеланий</comment>
  <registerRecords>InformationRegister.СостоянияВерсии</registerRecords>
  <attributes>
    <name>ФизическоеЛицо</name>
    <comment>Физическое лицо, подающее заявку</comment>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗаявки</name>
    <comment>Тип заявки (отгул, отпуск, больничный, жалобы/пожелания)</comment>
    <type>
      <types>CatalogRef.ТипыЗаявок</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <comment>Дата начала периода для отгула, отпуска, больничного</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <comment>Дата окончания периода для отгула, отпуска, больничного</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Причина</name>
    <comment>Причина или описание заявки</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <comment>Статус заявки (Открыта, Одобрена, Отказано)</comment>
    <type>
      <types>EnumRef.СтатусыЗаявок</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийОбработчика</name>
    <comment>Комментарий администратора при обработке заявки</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбработки</name>
    <comment>Дата и время обработки заявки администратором</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
</mdclass:Document>

GitConverter/src/CommonModules/УправлениеЗаявками/Module.bsl
// Модуль для работы с системой заявок

// Проверяет, является ли текущий пользователь пользователем для подачи запросов
//
// Возвращаемое значение:
//   Булево - Истина, если пользователь может подавать заявки
//
Функция ТекущийПользовательМожетПодаватьЗаявки() Экспорт
	
	// Получаем настройки пользователей для запросов
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НастройкиЗаявок.ЗначениеСписок
	|ИЗ
	|	РегистрСведений.НастройкиЗаявок КАК НастройкиЗаявок
	|ГДЕ
	|	НастройкиЗаявок.НастройкаПараметр = &Параметр";
	
	Запрос.УстановитьПараметр("Параметр", "ПользователиДляЗапросов");
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.ЗначениеСписок) Тогда
		
		СписокПользователей = ОбщегоНазначения.ЗначениеИзСтрокиXML(Выборка.ЗначениеСписок);
		ТекущийПользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
		
		Для Каждого ЭлементСписка Из СписокПользователей Цикл
			Если ЭлементСписка.Значение = ТекущийПользователь Тогда
				Возврат Истина;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

// Проверяет, является ли текущий пользователь администратором системы заявок
//
// Возвращаемое значение:
//   Булево - Истина, если пользователь может обрабатывать заявки
//
Функция ТекущийПользовательМожетОбрабатыватьЗаявки() Экспорт
	
	// Получаем настройки получателей запросов
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НастройкиЗаявок.ЗначениеСписок
	|ИЗ
	|	РегистрСведений.НастройкиЗаявок КАК НастройкиЗаявок
	|ГДЕ
	|	НастройкиЗаявок.НастройкаПараметр = &Параметр";
	
	Запрос.УстановитьПараметр("Параметр", "ПолучателиЗапросов");
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.ЗначениеСписок) Тогда
		
		СписокПользователей = ОбщегоНазначения.ЗначениеИзСтрокиXML(Выборка.ЗначениеСписок);
		ТекущийПользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
		
		Для Каждого ЭлементСписка Из СписокПользователей Цикл
			Если ЭлементСписка.Значение = ТекущийПользователь Тогда
				Возврат Истина;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

// Открывает форму подачи заявки для текущего пользователя
//
Процедура ОткрытьФормуПодачиЗаявки() Экспорт
	
	Если ТекущийПользовательМожетПодаватьЗаявки() Тогда
		ОткрытьФорму("Документ.Заявка.ФормаОбъекта");
	Иначе
		ПоказатьПредупреждение(, "У вас нет прав на подачу заявок!");
	КонецЕсли;
	
КонецПроцедуры

// Возвращает количество новых заявок для текущего администратора
//
// Возвращаемое значение:
//   Число - Количество открытых заявок
//
Функция ПолучитьКоличествоНовыхЗаявок() Экспорт
	
	Если НЕ ТекущийПользовательМожетОбрабатыватьЗаявки() Тогда
		Возврат 0;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(*) КАК Количество
	|ИЗ
	|	Документ.Заявка КАК Заявка
	|ГДЕ
	|	НЕ Заявка.ПометкаУдаления
	|	И Заявка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявок.Открыта)";
	
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат Выборка.Количество;
		КонецЕсли;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

// Инициализирует предопределенные типы заявок при первом запуске
//
Процедура ИнициализироватьПредопределенныеТипыЗаявок() Экспорт
	
	// Проверяем, есть ли уже типы заявок
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(*) КАК Количество
	|ИЗ
	|	Справочник.ТипыЗаявок КАК ТипыЗаявок
	|ГДЕ
	|	НЕ ТипыЗаявок.ПометкаУдаления";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() И Выборка.Количество = 0 Тогда
		
		// Создаем предопределенные типы заявок
		ПредопределенныеТипы = Новый Массив;
		ПредопределенныеТипы.Добавить(Новый Структура("Наименование, ТребуетПериод", "Отгул", Истина));
		ПредопределенныеТипы.Добавить(Новый Структура("Наименование, ТребуетПериод", "Отпуск", Истина));
		ПредопределенныеТипы.Добавить(Новый Структура("Наименование, ТребуетПериод", "Больничный", Истина));
		ПредопределенныеТипы.Добавить(Новый Структура("Наименование, ТребуетПериод", "Жалобы и пожелания", Ложь));
		
		Для Каждого ТипЗаявки Из ПредопределенныеТипы Цикл
			НовыйТип = Справочники.ТипыЗаявок.СоздатьЭлемент();
			НовыйТип.Наименование = ТипЗаявки.Наименование;
			НовыйТип.ТребуетПериод = ТипЗаявки.ТребуетПериод;
			
			Попытка
				НовыйТип.Записать();
			Исключение
				// Игнорируем ошибки при создании предопределенных типов
			КонецПопытки;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры
